Fuentes/ficohsacore-osb-7e5cceccb837/Middleware/v2/Resources/ValidaDepositoReferenciadoCB/wsdl/validaDepositoReferenciadoCBPS.wsdl

<wsdl:definitions name="ValidaDepositoReferenciadoCB" targetNamespace="http://www.ficohsa.com.hn/middleware.services/ValidaDepositoReferenciadoCBTypes" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:FicVdr="http://www.ficohsa.com.hn/middleware.services/ValidaDepositoReferenciadoCBTypes" xmlns:auth="http://www.ficohsa.com.hn/middleware.services/autType" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/">
	<!-- ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
	TYPE DEFINITION - List of services participating in this BPEL process
	The default output of the BPEL designer uses strings as input and 
	output to the BPEL Process. But you can define or import any XML 
	Schema type and use them as part of the message types.
	~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ -->
	<wsdl:types>
		<xsd:schema>
			<xsd:import namespace="http://www.ficohsa.com.hn/middleware.services/autType" schemaLocation="../../esquemas_generales/HeaderElementsCB.xsd"/>
		</xsd:schema>
		<schema xmlns="http://www.w3.org/2001/XMLSchema">
			<import namespace="http://www.ficohsa.com.hn/middleware.services/ValidaDepositoReferenciadoCBTypes" schemaLocation="../xsd/validaDepositoReferenciadoCBTypes.xsd"/>
		</schema>
	</wsdl:types>
	<!-- ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
	MESSAGE TYPE DEFINITION - Definition of the message types used as 
	part of the port type defintions
	~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ -->
	<wsdl:message name="ValidaDepositoReferenciadoCBRequestMessage">
		<wsdl:part name="payload" element="FicVdr:validaDepositoReferenciadoCBRequest"/>
		<wsdl:part element="auth:RequestHeader" name="RequestHeader"/>
	</wsdl:message>
	<wsdl:message name="ValidaDepositoReferenciadoCBResponseMessage">
		<wsdl:part name="payload" element="FicVdr:validaDepositoReferenciadoCBResponse"/>
		<wsdl:part element="auth:ResponseHeader" name="ResponseHeader"/>
	</wsdl:message>
	<!-- ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
	PORT TYPE DEFINITION - A port type groups a set of operations into
	a logical service unit.
	~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ -->
	<wsdl:portType name="ValidaDepositoReferenciadoCB">
		<wsdl:operation name="ValidaDepositoReferenciadoCB">
			<wsdl:input message="FicVdr:ValidaDepositoReferenciadoCBRequestMessage"/>
			<wsdl:output message="FicVdr:ValidaDepositoReferenciadoCBResponseMessage"/>
		</wsdl:operation>
	</wsdl:portType>
	<!-- ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
	PARTNER LINK TYPE DEFINITION
	~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ -->
	<wsdl:binding name="ValidaDepositoReferenciadoCBSOAP" type="FicVdr:ValidaDepositoReferenciadoCB">
		<soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
		<wsdl:operation name="ValidaDepositoReferenciadoCB">
			<soap:operation style="document" soapAction="http://www.ficohsa.com.hn/middleware.services/ValidaDepositoReferenciadoCBPS/ValidaDepositoReferenciadoCB"/>
			<wsdl:input>
				<soap:body use="literal" parts="payload"/>
				<soap:header message="FicVdr:ValidaDepositoReferenciadoCBRequestMessage" use="literal" part="RequestHeader"/>
			</wsdl:input>
			<wsdl:output>
				<soap:body use="literal" parts="payload"/>
				<soap:header message="FicVdr:ValidaDepositoReferenciadoCBResponseMessage" use="literal" part="ResponseHeader"/>
			</wsdl:output>
		</wsdl:operation>
	</wsdl:binding>
	<wsdl:service name="ValidaDepositoReferenciadoCBPS">
		<wsdl:port name="ValidaDepositoReferenciadoCBPSSOAP" binding="FicVdr:ValidaDepositoReferenciadoCBSOAP">
			<soap:address location="http://172.23.13.19:8003/Middleware/OperationsAndExecution/CalculationServices/ValidaDepositoReferenciadoCB"/>
		</wsdl:port>
	</wsdl:service>
</wsdl:definitions>